Revit 2027 API
BuiltInFailures.OverlapFailures.WallSpaceSeparationOverlap Property
 A wall and a space separation line overlap. One of them may be ignored when Revit finds space boundaries. Shorten or delete the space separation line to remove the overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WallSpaceSeparationOverlap { get; }
Public Shared ReadOnly Property WallSpaceSeparationOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WallSpaceSeparationOverlap {
	FailureDefinitionId^ get ();
}
static member WallSpaceSeparationOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OverlapFailures Class
Autodesk.Revit.DB Namespace